pyocd/pyOCD/pyocd/debug/svd/data/nrf54l15.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>TPIU_NS</name>
      <description>Trace Port Interface Unit</description>
      <baseAddress>0xE0040000</baseAddress>
      <headerStructName>TPIU</headerStructName>
      <!--Security dma=NA-->
      <!--Security securemapping=NS-->
      <addressBlock>
        <offset>0</offset>
        <size>0x1000</size>
        <usage>registers</usage>
      </addressBlock>
      <groupName>TPIU</groupName>
      <size>0x20</size>
      <registers>
        <register>
          <name>SUPPORTEDPORTSIZES</name>
          <description>Each bit location is a single port size that is supported on the device.</description>
          <addressOffset>0x000</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>PORT_SIZE_1</name>
              <description>Indicates whether the TPIU supports port size of 1-bit.</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NotSupported</name>
                  <description>Port size 1 is not supported.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Supported</name>
                  <description>Port size 1 is supported.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PORT_SIZE_2</name>
              <description>Indicates whether the TPIU supports port size of 2-bit.</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NotSupported</name>
                  <description>Port size 2 is not supported.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Supported</name>
                  <description>Port size 2 is supported.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PORT_SIZE_3</name>
              <description>Indicates whether the TPIU supports port size of 3-bit.</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NotSupported</name>
                  <description>Port size 3 is not supported.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Supported</name>
                  <description>Port size 3 is supported.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PORT_SIZE_4</name>
              <description>Indicates whether the TPIU supports port size of 4-bit.</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NotSupported</name>
                  <description>Port size 4 is not supported.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Supported</name>
                  <description>Port size 4 is supported.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PORT_SIZE_5</name>
              <description>Indicates whether the TPIU supports port size of 5-bit.</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NotSupported</name>
                  <description>Port size 5 is not supported.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Supported</name>
                  <description>Port size 5 is supported.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PORT_SIZE_6</name>
              <description>Indicates whether the TPIU supports port size of 6-bit.</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NotSupported</name>
                  <description>Port size 6 is not supported.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Supported</name>
                  <description>Port size 6 is supported.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PORT_SIZE_7</name>
              <description>Indicates whether the TPIU supports port size of 7-bit.</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NotSupported</name>
                  <description>Port size 7 is not supported.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Supported</name>
                  <description>Port size 7 is supported.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PORT_SIZE_8</name>
              <description>Indicates whether the TPIU supports port size of 8-bit.</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NotSupported</name>
                  <description>Port size 8 is not supported.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Supported</name>
                  <description>Port size 8 is supported.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PORT_SIZE_9</name>
              <description>Indicates whether the TPIU supports port size of 9-bit.</description>
              <lsb>8</lsb>
              <msb>8</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NotSupported</name>
                  <description>Port size 9 is not supported.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Supported</name>
                  <description>Port size 9 is supported.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PORT_SIZE_10</name>
              <description>Indicates whether the TPIU supports port size of 10-bit.</description>
              <lsb>9</lsb>
              <msb>9</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NotSupported</name>
                  <description>Port size 10 is not supported.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Supported</name>
                  <description>Port size 10 is supported.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PORT_SIZE_11</name>
              <description>Indicates whether the TPIU supports port size of 11-bit.</description>
              <lsb>10</lsb>
              <msb>10</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NotSupported</name>
                  <description>Port size 11 is not supported.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Supported</name>
                  <description>Port size 11 is supported.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PORT_SIZE_12</name>
              <description>Indicates whether the TPIU supports port size of 12-bit.</description>
              <lsb>11</lsb>
              <msb>11</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NotSupported</name>
                  <description>Port size 12 is not supported.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Supported</name>
                  <description>Port size 12 is supported.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PORT_SIZE_13</name>
              <description>Indicates whether the TPIU supports port size of 13-bit.</description>
              <lsb>12</lsb>
              <msb>12</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NotSupported</name>
                  <description>Port size 13 is not supported.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Supported</name>
                  <description>Port size 13 is supported.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PORT_SIZE_14</name>
              <description>Indicates whether the TPIU supports port size of 14-bit.</description>
              <lsb>13</lsb>
              <msb>13</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NotSupported</name>
                  <description>Port size 14 is not supported.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Supported</name>
                  <description>Port size 14 is supported.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PORT_SIZE_15</name>
              <description>Indicates whether the TPIU supports port size of 15-bit.</description>
              <lsb>14</lsb>
              <msb>14</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NotSupported</name>
                  <description>Port size 15 is not supported.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Supported</name>
                  <description>Port size 15 is supported.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PORT_SIZE_16</name>
              <description>Indicates whether the TPIU supports port size of 16-bit.</description>
              <lsb>15</lsb>
              <msb>15</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NotSupported</name>
                  <description>Port size 16 is not supported.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Supported</name>
                  <description>Port size 16 is supported.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PORT_SIZE_17</name>
              <description>Indicates whether the TPIU supports port size of 17-bit.</description>
              <lsb>16</lsb>
              <msb>16</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NotSupported</name>
                  <description>Port size 17 is not supported.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Supported</name>
                  <description>Port size 17 is supported.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PORT_SIZE_18</name>
              <description>Indicates whether the TPIU supports port size of 18-bit.</description>
              <lsb>17</lsb>
              <msb>17</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NotSupported</name>
                  <description>Port size 18 is not supported.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Supported</name>
                  <description>Port size 18 is supported.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PORT_SIZE_19</name>
              <description>Indicates whether the TPIU supports port size of 19-bit.</description>
              <lsb>18</lsb>
              <msb>18</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NotSupported</name>
                  <description>Port size 19 is not supported.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Supported</name>
                  <description>Port size 19 is supported.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PORT_SIZE_20</name>
              <description>Indicates whether the TPIU supports port size of 20-bit.</description>
              <lsb>19</lsb>
              <msb>19</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NotSupported</name>
                  <description>Port size 20 is not supported.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Supported</name>
                  <description>Port size 20 is supported.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PORT_SIZE_21</name>
              <description>Indicates whether the TPIU supports port size of 21-bit.</description>
              <lsb>20</lsb>
              <msb>20</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NotSupported</name>
                  <description>Port size 21 is not supported.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Supported</name>
                  <description>Port size 21 is supported.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PORT_SIZE_22</name>
              <description>Indicates whether the TPIU supports port size of 22-bit.</description>
              <lsb>21</lsb>
              <msb>21</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NotSupported</name>
                  <description>Port size 22 is not supported.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Supported</name>
                  <description>Port size 22 is supported.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PORT_SIZE_23</name>
              <description>Indicates whether the TPIU supports port size of 23-bit.</description>
              <lsb>22</lsb>
              <msb>22</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NotSupported</name>
                  <description>Port size 23 is not supported.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Supported</name>
                  <description>Port size 23 is supported.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PORT_SIZE_24</name>
              <description>Indicates whether the TPIU supports port size of 24-bit.</description>
              <lsb>23</lsb>
              <msb>23</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NotSupported</name>
                  <description>Port size 24 is not supported.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Supported</name>
                  <description>Port size 24 is supported.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PORT_SIZE_25</name>
              <description>Indicates whether the TPIU supports port size of 25-bit.</description>
              <lsb>24</lsb>
              <msb>24</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NotSupported</name>
                  <description>Port size 25 is not supported.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Supported</name>
                  <description>Port size 25 is supported.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PORT_SIZE_26</name>
              <description>Indicates whether the TPIU supports port size of 26-bit.</description>
              <lsb>25</lsb>
              <msb>25</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NotSupported</name>
                  <description>Port size 26 is not supported.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Supported</name>
                  <description>Port size 26 is supported.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PORT_SIZE_27</name>
              <description>Indicates whether the TPIU supports port size of 27-bit.</description>
              <lsb>26</lsb>
              <msb>26</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NotSupported</name>
                  <description>Port size 27 is not supported.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Supported</name>
                  <description>Port size 27 is supported.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PORT_SIZE_28</name>
              <description>Indicates whether the TPIU supports port size of 28-bit.</description>
              <lsb>27</lsb>
              <msb>27</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NotSupported</name>
                  <description>Port size 28 is not supported.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Supported</name>
                  <description>Port size 28 is supported.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PORT_SIZE_29</name>
              <description>Indicates whether the TPIU supports port size of 29-bit.</description>
              <lsb>28</lsb>
              <msb>28</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NotSupported</name>
                  <description>Port size 29 is not supported.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Supported</name>
                  <description>Port size 29 is supported.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PORT_SIZE_30</name>
              <description>Indicates whether the TPIU supports port size of 30-bit.</description>
              <lsb>29</lsb>
              <msb>29</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NotSupported</name>
                  <description>Port size 30 is not supported.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Supported</name>
                  <description>Port size 30 is supported.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PORT_SIZE_31</name>
              <description>Indicates whether the TPIU supports port size of 31-bit.</description>
              <lsb>30</lsb>
              <msb>30</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NotSupported</name>
                  <description>Port size 31 is not supported.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Supported</name>
                  <description>Port size 31 is supported.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
