pyocd/pyOCD/pyocd/debug/svd/data/nrf54l15.svd
            <register>
              <dim>0x8</dim>
              <dimIncrement>0x4</dimIncrement>
              <name>INTERRUPT[%s]</name>
              <description>Description collection: Configuration of features for interrupt o of GPIOTE[n]</description>
              <addressOffset>0x020</addressOffset>
              <access>read-write</access>
              <resetValue>0x00100010</resetValue>
              <size>0x20</size>
              <fields>
                <field>
                  <name>SECATTR</name>
                  <description>SECATTR feature</description>
                  <lsb>4</lsb>
                  <msb>4</msb>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>NonSecure</name>
                      <description>Feature is available for non-secure usage</description>
                      <value>0x0</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>Secure</name>
                      <description>Feature is reserved for secure usage</description>
                      <value>0x1</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
                <field>
                  <name>LOCK</name>
                  <description>LOCK feature</description>
                  <lsb>8</lsb>
                  <msb>8</msb>
                  <modifiedWriteValues>oneToSet</modifiedWriteValues>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>Unlocked</name>
                      <description>Feature permissions can be updated</description>
                      <value>0x0</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>Locked</name>
                      <description>Feature permissions can not be changed until the next reset</description>
                      <value>0x1</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
              </fields>
            </register>
          </cluster>
          <cluster>
            <dim>3</dim>
            <dimIncrement>0x080</dimIncrement>
            <name>GPIO[%s]</name>
            <description>Unspecified</description>
            <headerStructName>GPIO</headerStructName>
            <access>read-write</access>
            <addressOffset>0x200</addressOffset>
            <register>
              <dim>0x20</dim>
              <dimIncrement>0x4</dimIncrement>
              <name>PIN[%s]</name>
              <description>Description collection: Configuration of features for GPIO[n] PIN[o]</description>
              <addressOffset>0x000</addressOffset>
              <access>read-write</access>
              <resetValue>0x00100010</resetValue>
              <size>0x20</size>
              <fields>
                <field>
                  <name>SECATTR</name>
                  <description>SECATTR feature</description>
                  <lsb>4</lsb>
                  <msb>4</msb>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>NonSecure</name>
                      <description>Feature is available for non-secure usage</description>
                      <value>0x0</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>Secure</name>
                      <description>Feature is reserved for secure usage</description>
                      <value>0x1</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
                <field>
                  <name>LOCK</name>
                  <description>LOCK feature</description>
                  <lsb>8</lsb>
                  <msb>8</msb>
                  <modifiedWriteValues>oneToSet</modifiedWriteValues>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>Unlocked</name>
                      <description>Feature permissions can be updated</description>
                      <value>0x0</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>Locked</name>
                      <description>Feature permissions can not be changed until the next reset</description>
                      <value>0x1</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
              </fields>
            </register>
          </cluster>
          <cluster>
            <name>CRACEN</name>
            <description>Unspecified</description>
            <headerStructName>CRACEN</headerStructName>
            <alternateCluster>GPIO[%s]</alternateCluster>
            <access>read-write</access>
            <addressOffset>0x200</addressOffset>
            <register>
              <name>SEED</name>
              <description>Configuration for CRACEN SEED</description>
              <addressOffset>0x180</addressOffset>
              <access>read-write</access>
              <resetValue>0x00020010</resetValue>
              <size>0x20</size>
              <fields>
                <field>
                  <name>SECATTR</name>
                  <description>SECATTR feature</description>
                  <lsb>4</lsb>
                  <msb>4</msb>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>NonSecure</name>
                      <description>Feature is available for non-secure usage</description>
                      <value>0x0</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>Secure</name>
                      <description>Feature is reserved for secure usage</description>
                      <value>0x1</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
                <field>
                  <name>LOCK</name>
                  <description>LOCK feature</description>
                  <lsb>8</lsb>
                  <msb>8</msb>
                  <modifiedWriteValues>oneToSet</modifiedWriteValues>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>Unlocked</name>
                      <description>Feature permissions can be updated</description>
                      <value>0x0</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>Locked</name>
                      <description>Feature permissions can not be changed until the next reset</description>
                      <value>0x1</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
              </fields>
            </register>
          </cluster>
          <cluster>
            <name>GRTC</name>
            <description>Unspecified</description>
            <headerStructName>SPU_FEATURE_GRTC</headerStructName>
            <access>read-write</access>
            <addressOffset>0x700</addressOffset>
            <register>
              <dim>0x18</dim>
              <dimIncrement>0x4</dimIncrement>
              <name>CC[%s]</name>
              <description>Description collection: Configuration of features for CC n of GRTC</description>
              <addressOffset>0x000</addressOffset>
              <access>read-write</access>
              <resetValue>0x00100010</resetValue>
              <size>0x20</size>
              <fields>
                <field>
                  <name>SECATTR</name>
                  <description>SECATTR feature</description>
                  <lsb>4</lsb>
                  <msb>4</msb>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>NonSecure</name>
                      <description>Feature is available for non-secure usage</description>
                      <value>0x0</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>Secure</name>
                      <description>Feature is reserved for secure usage</description>
                      <value>0x1</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
                <field>
                  <name>LOCK</name>
                  <description>LOCK feature</description>
                  <lsb>8</lsb>
                  <msb>8</msb>
                  <modifiedWriteValues>oneToSet</modifiedWriteValues>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>Unlocked</name>
                      <description>Feature permissions can be updated</description>
                      <value>0x0</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>Locked</name>
                      <description>Feature permissions can not be changed until the next reset</description>
                      <value>0x1</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
              </fields>
            </register>
            <register>
              <name>PWMCONFIG</name>
              <description>Configuration of feature for PWMCONFIG of GRTC</description>
              <addressOffset>0x074</addressOffset>
              <access>read-write</access>
              <resetValue>0x00100010</resetValue>
              <size>0x20</size>
              <fields>
                <field>
                  <name>SECATTR</name>
                  <description>SECATTR feature</description>
                  <lsb>4</lsb>
                  <msb>4</msb>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>NonSecure</name>
                      <description>Feature is available for non-secure usage</description>
                      <value>0x0</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>Secure</name>
                      <description>Feature is reserved for secure usage</description>
                      <value>0x1</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
                <field>
                  <name>LOCK</name>
                  <description>LOCK feature</description>
                  <lsb>8</lsb>
                  <msb>8</msb>
                  <modifiedWriteValues>oneToSet</modifiedWriteValues>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>Unlocked</name>
                      <description>Feature permissions can be updated</description>
                      <value>0x0</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>Locked</name>
                      <description>Feature permissions can not be changed until the next reset</description>
                      <value>0x1</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
              </fields>
            </register>
            <register>
              <name>CLK</name>
              <description>Configuration of features for CLKOUT/CLKCFG of GRTC</description>
              <addressOffset>0x078</addressOffset>
              <access>read-write</access>
              <resetValue>0x00100010</resetValue>
              <size>0x20</size>
              <fields>
                <field>
                  <name>SECATTR</name>
                  <description>SECATTR feature</description>
                  <lsb>4</lsb>
                  <msb>4</msb>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>NonSecure</name>
                      <description>Feature is available for non-secure usage</description>
                      <value>0x0</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>Secure</name>
                      <description>Feature is reserved for secure usage</description>
                      <value>0x1</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
                <field>
                  <name>LOCK</name>
                  <description>LOCK feature</description>
                  <lsb>8</lsb>
                  <msb>8</msb>
                  <modifiedWriteValues>oneToSet</modifiedWriteValues>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>Unlocked</name>
                      <description>Feature permissions can be updated</description>
                      <value>0x0</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>Locked</name>
                      <description>Feature permissions can not be changed until the next reset</description>
                      <value>0x1</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
              </fields>
            </register>
            <register>
              <name>SYSCOUNTER</name>
              <description>Configuration of features for SYSCOUNTERL/SYSCOUNTERH of GRTC</description>
              <addressOffset>0x07C</addressOffset>
              <access>read-write</access>
              <resetValue>0x00100010</resetValue>
              <size>0x20</size>
              <fields>
                <field>
                  <name>SECATTR</name>
                  <description>SECATTR feature</description>
                  <lsb>4</lsb>
                  <msb>4</msb>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>NonSecure</name>
                      <description>Feature is available for non-secure usage</description>
                      <value>0x0</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>Secure</name>
                      <description>Feature is reserved for secure usage</description>
                      <value>0x1</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
                <field>
                  <name>LOCK</name>
                  <description>LOCK feature</description>
                  <lsb>8</lsb>
                  <msb>8</msb>
                  <modifiedWriteValues>oneToSet</modifiedWriteValues>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>Unlocked</name>
                      <description>Feature permissions can be updated</description>
                      <value>0x0</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>Locked</name>
                      <description>Feature permissions can not be changed until the next reset</description>
                      <value>0x1</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
              </fields>
            </register>
            <register>
              <dim>0x10</dim>
              <dimIncrement>0x4</dimIncrement>
              <name>INTERRUPT[%s]</name>
              <description>Description collection: Configuration of features for interrupt n of GRTC</description>
              <addressOffset>0x080</addressOffset>
              <access>read-write</access>
              <resetValue>0x00100010</resetValue>
              <size>0x20</size>
              <fields>
                <field>
                  <name>SECATTR</name>
                  <description>SECATTR feature</description>
                  <lsb>4</lsb>
                  <msb>4</msb>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>NonSecure</name>
                      <description>Feature is available for non-secure usage</description>
                      <value>0x0</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>Secure</name>
                      <description>Feature is reserved for secure usage</description>
                      <value>0x1</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
                <field>
                  <name>LOCK</name>
                  <description>LOCK feature</description>
                  <lsb>8</lsb>
                  <msb>8</msb>
                  <modifiedWriteValues>oneToSet</modifiedWriteValues>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>Unlocked</name>
                      <description>Feature permissions can be updated</description>
                      <value>0x0</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>Locked</name>
                      <description>Feature permissions can not be changed until the next reset</description>
                      <value>0x1</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
              </fields>
            </register>
          </cluster>
        </cluster>
