pyocd/pyOCD/pyocd/debug/svd/data/nrf54l15.svd
          <register>
            <name>PHASESHIFT</name>
            <description>Parameter used in TPM, provided by software</description>
            <addressOffset>0x018</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>PHASESHIFT</name>
                <description>Phase shift used in TPM calculation</description>
                <lsb>0</lsb>
                <msb>15</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>NUMSAMPLESCOEFF</name>
            <description>Parameter used in TPM, provided by software</description>
            <addressOffset>0x01C</addressOffset>
            <access>read-write</access>
            <resetValue>0x0000199A</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>NUMSAMPLESCOEFF</name>
                <description>Coefficient 2**16/(numSamples/16) in Q1.15 format (Default numsamples value is 160)</description>
                <lsb>0</lsb>
                <msb>15</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>PCT16</name>
            <description>Mean magnitude and mean phase converted to IQ</description>
            <addressOffset>0x020</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>PCT16I</name>
                <description>Inphase</description>
                <lsb>0</lsb>
                <msb>15</msb>
              </field>
              <field>
                <name>PCT16Q</name>
                <description>Quadrature</description>
                <lsb>16</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>MAGPHASEMEAN</name>
            <description>Mean magnitude and phase of the signal before it is converted to PCT16</description>
            <addressOffset>0x024</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>PHASE</name>
                <description>Mean phase</description>
                <lsb>0</lsb>
                <msb>15</msb>
              </field>
              <field>
                <name>MAG</name>
                <description>Mean magnitude</description>
                <lsb>16</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>IQRAWMEAN</name>
            <description>Mean of IQ values</description>
            <addressOffset>0x028</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>IQRAWMEANI</name>
                <description>Inphase</description>
                <lsb>0</lsb>
                <msb>15</msb>
              </field>
              <field>
                <name>IQRAWMEANQ</name>
                <description>Quadrature</description>
                <lsb>16</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>MAGSTD</name>
            <description>Magnitude standard deviation approximation</description>
            <addressOffset>0x02C</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>MAGSTD</name>
                <description>Magnitude standard deviation approximation</description>
                <lsb>0</lsb>
                <msb>15</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>CNACC</name>
            <description>Output of the autocorrelation of the accumulated IQ signal</description>
            <addressOffset>0x030</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>CNACCI</name>
                <lsb>0</lsb>
                <msb>15</msb>
              </field>
              <field>
                <name>CNACCQ</name>
                <lsb>16</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>FFOEST</name>
            <description>FFO estimate</description>
            <addressOffset>0x034</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>FFOEST</name>
                <description>Units 62.5 ppb. Max range +/-100 ppm plus margin.</description>
                <lsb>0</lsb>
                <msb>11</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>DOWNSAMPLE</name>
            <description>Turn on/off down sample of input IQ-signals</description>
            <addressOffset>0x038</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>ENABLEFILTER</name>
                <description>Turn on/off down sample of input IQ-signals</description>
                <lsb>0</lsb>
                <msb>0</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>OFF</name>
                    <description>Disable filter</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>ON</name>
                    <description>Enable filter</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>RATE</name>
                <description>Indicating if BLE1M or BLE2M is used</description>
                <lsb>1</lsb>
                <msb>1</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>BLE1M</name>
                    <description>Radio mode BLE1M is used</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>BLE2m</name>
                    <description>Radio mode BLE2M is used</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>FINETUNENEXT</name>
            <description>Number of full ADPLL finetune steps</description>
            <addressOffset>0x03C</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>FINETUNENEXT</name>
                <description>Units of 488.28125 Hz</description>
                <lsb>0</lsb>
                <msb>12</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>CFOPHASE</name>
            <description>Cordic output of CnAcc</description>
            <addressOffset>0x040</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>CFOPHASE</name>
                <lsb>0</lsb>
                <msb>15</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>FREQOFFSET</name>
            <description>Frequency offset estimate</description>
            <addressOffset>0x044</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>FREQOFFSET</name>
                <lsb>0</lsb>
                <msb>13</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>PCT11</name>
            <description>Mean magnitude and mean phase converted to IQ. IQ values limited to [-1024,1023].</description>
            <addressOffset>0x048</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>PCT11I</name>
                <description>Inphase</description>
                <lsb>0</lsb>
                <msb>10</msb>
              </field>
              <field>
                <name>PCT11Q</name>
                <description>Quadrature</description>
                <lsb>11</lsb>
                <msb>21</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>LFAENEXT</name>
            <description>Quantization error between ADPLL frequency and the desired value of FFO * RF Frequency. Values limited to [-64,63] with units 7.6294 Hz.</description>
            <addressOffset>0x04C</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>LFAENEXT</name>
                <description>Inphase</description>
                <lsb>0</lsb>
                <msb>6</msb>
              </field>
            </fields>
          </register>
        </cluster>
        <cluster>
          <name>RTT</name>
          <description>Unspecified</description>
          <headerStructName>RADIO_RTT</headerStructName>
          <access>read-write</access>
          <addressOffset>0x1050</addressOffset>
          <register>
            <name>CONFIG</name>
            <description>RTT Config.</description>
            <addressOffset>0x0000</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>EN</name>
                <description>Enable RTT Functionality. Only valid for BLE 1MBPS and 2MBPS mode</description>
                <lsb>0</lsb>
                <msb>0</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Disabled</name>
                    <description>Disable RTT Block</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Enabled</name>
                    <description>Enable RTT Block</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>ENFULLAA</name>
                <description>Enabling/Disable ping over the entire access address.</description>
                <lsb>1</lsb>
                <msb>1</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Disabled</name>
                    <description>Disable ping over the entire access address, i.e., enable only over the first 16-bit access address</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Enabled</name>
                    <description>Enable ping over the entire access address</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>ROLE</name>
                <description>Role as a Initiator or Reflector.</description>
                <lsb>2</lsb>
                <msb>2</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Initiator</name>
                    <description>Initiator</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Reflector</name>
                    <description>Reflector</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>NUMSEGMENTS</name>
                <description>Number of 16bit payload segments available for ToA detection. Allowed values are 0, 2, 4, 6 and 8.</description>
                <lsb>3</lsb>
                <msb>6</msb>
              </field>
              <field>
                <name>EFSDELAY</name>
                <description>Early Frame Sync Delay, i.e., number of cycles to wait for access address to anchor correctly. For 2MBPSBLE mode, the EFSDELAY value is 64 (2us) and for 1MBPSBLE mode, it can be 256 (8us).</description>
                <lsb>8</lsb>
                <msb>16</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>SEGMENT01</name>
            <description>RTT segments 0 and 1</description>
            <addressOffset>0x0004</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>DATA</name>
                <description>Data Bits 31 - 0</description>
                <lsb>0</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>SEGMENT23</name>
            <description>RTT segments 2 and 3</description>
            <addressOffset>0x0008</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>DATA</name>
                <description>Data Bits 63 - 32</description>
                <lsb>0</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>SEGMENT45</name>
            <description>RTT segments 4 and 5</description>
            <addressOffset>0x000C</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>DATA</name>
                <description>Data Bits 95 - 64</description>
                <lsb>0</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>SEGMENT67</name>
            <description>RTT segments 6 and 7</description>
            <addressOffset>0x0010</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>DATA</name>
                <description>Data Bits 127 - 96</description>
                <lsb>0</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
        </cluster>
