pyocd/pyOCD/pyocd/debug/svd/data/nrf54l15.svd
        <register>
          <name>CLKOUT</name>
          <description>Configuration of clock output</description>
          <addressOffset>0x714</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>CLKOUT32K</name>
              <description>Enable 32Ki clock output on pin</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Disabled</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CLKOUTFAST</name>
              <description>Enable fast clock output on pin</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Disabled</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CLKCFG</name>
          <description>Clock Configuration</description>
          <addressOffset>0x718</addressOffset>
          <access>read-write</access>
          <resetValue>0x00010001</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>CLKFASTDIV</name>
              <description>Fast clock divisor value of clock output</description>
              <lsb>0</lsb>
              <msb>7</msb>
            </field>
            <field>
              <name>CLKSEL</name>
              <description>GRTC LFCLK clock source selection</description>
              <lsb>16</lsb>
              <msb>17</msb>
              <access>write-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LFXO</name>
                  <description>GRTC LFCLK clock source is LFXO</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SystemLFCLK</name>
                  <description>GRTC LFCLK clock source is system LFCLK</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LFLPRC</name>
                  <description>GRTC LFCLK clock source is LFLPRC</description>
                  <value>0x2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <cluster>
          <dim>4</dim>
          <dimIncrement>0x010</dimIncrement>
          <name>SYSCOUNTER[%s]</name>
          <description>Unspecified</description>
          <headerStructName>GRTC_SYSCOUNTER</headerStructName>
          <access>read-write</access>
          <addressOffset>0x720</addressOffset>
          <register>
            <name>SYSCOUNTERL</name>
            <description>Description cluster: The lower 32-bits of the SYSCOUNTER for index [n]</description>
            <addressOffset>0x000</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>VALUE</name>
                <description>The lower 32-bits of the SYSCOUNTER value.</description>
                <lsb>0</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>SYSCOUNTERH</name>
            <description>Description cluster: The higher 20-bits of the SYSCOUNTER for index [n]</description>
            <addressOffset>0x004</addressOffset>
            <access>read-only</access>
            <resetValue>0x40000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>VALUE</name>
                <description>The higher 20-bits of the SYSCOUNTER value.</description>
                <lsb>0</lsb>
                <msb>19</msb>
              </field>
              <field>
                <name>BUSY</name>
                <description>SYSCOUNTER busy status</description>
                <lsb>30</lsb>
                <msb>30</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Ready</name>
                    <description>SYSCOUNTER is ready for read</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Busy</name>
                    <description>SYSCOUNTER is busy, so not ready for read (value returned in the VALUE field of this register is not valid)</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>OVERFLOW</name>
                <description>The SYSCOUNTERL overflow indication after reading it.</description>
                <lsb>31</lsb>
                <msb>31</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>NoOverflow</name>
                    <description>SYSCOUNTERL is not overflown</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Overflow</name>
                    <description>SYSCOUNTERL overflown</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>ACTIVE</name>
            <description>Description cluster: Request to keep the SYSCOUNTER in the active state and prevent going to sleep for index [n]</description>
            <addressOffset>0x008</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>ACTIVE</name>
                <description>Keep SYSCOUNTER in active state</description>
                <lsb>0</lsb>
                <msb>0</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>NotActive</name>
                    <description>Allow SYSCOUNTER to go to sleep</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Active</name>
                    <description>Keep SYSCOUNTER active</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
        </cluster>
