pyocd/pyOCD/pyocd/debug/svd/data/nrf54l15.svd
        <cluster>
          <name>PLL</name>
          <description>Unspecified</description>
          <headerStructName>CLOCK_PLL</headerStructName>
          <access>read-write</access>
          <addressOffset>0x420</addressOffset>
          <register>
            <name>RUN</name>
            <description>Indicates that PLLSTART task was triggered</description>
            <addressOffset>0x008</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>STATUS</name>
                <description>PLLSTART task triggered or not</description>
                <lsb>0</lsb>
                <msb>0</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>NotTriggered</name>
                    <description>Task not triggered</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Triggered</name>
                    <description>Task triggered</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>STAT</name>
            <description>Which PLL settings were selected when triggering START task</description>
            <addressOffset>0x00C</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>STATE</name>
                <description>PLL state (Running between START task and STOPPED event)</description>
                <lsb>16</lsb>
                <msb>16</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>NotRunning</name>
                    <description>PLL is not running</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Running</name>
                    <description>PLL is running</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
        </cluster>
        <cluster>
          <name>LFCLK</name>
          <description>Unspecified</description>
          <headerStructName>CLOCK_LFCLK</headerStructName>
          <access>read-write</access>
          <addressOffset>0x440</addressOffset>
          <register>
            <name>SRC</name>
            <description>Clock source for LFCLK</description>
            <addressOffset>0x000</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>SRC</name>
                <description>Select which LFCLK source is started by the LFCLKSTART task</description>
                <lsb>0</lsb>
                <msb>1</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>LFRC</name>
                    <description>32.768 kHz RC oscillator</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>LFXO</name>
                    <description>32.768 kHz crystal oscillator</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>LFSYNT</name>
                    <description>32.768 kHz synthesized from HFCLK</description>
                    <value>0x2</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>RUN</name>
            <description>Indicates that LFCLKSTART task was triggered</description>
            <addressOffset>0x008</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>STATUS</name>
                <description>LFCLKSTART task triggered or not</description>
                <lsb>0</lsb>
                <msb>0</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>NotTriggered</name>
                    <description>Task not triggered</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Triggered</name>
                    <description>Task triggered</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>STAT</name>
            <description>Copy of LFCLK.SRCCOPY register, set when LFCLKSTARTED event is triggered.</description>
            <addressOffset>0x00C</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>SRC</name>
                <description>Value of LFCLK.SRCCOPY register when LFCLKSTARTED event was triggered</description>
                <lsb>0</lsb>
                <msb>1</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>LFRC</name>
                    <description>32.768 kHz RC oscillator</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>LFXO</name>
                    <description>32.768 kHz crystal oscillator</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>LFSYNT</name>
                    <description>32.768 kHz synthesized from HFCLK</description>
                    <value>0x2</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>ALWAYSRUNNING</name>
                <description>ALWAYSRUN activated</description>
                <lsb>4</lsb>
                <msb>4</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>NotRunning</name>
                    <description>Automatic clock control enabled</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Running</name>
                    <description>Oscillator is always running</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>STATE</name>
                <description>LFCLK state (Running between START task and STOPPED event)</description>
                <lsb>16</lsb>
                <msb>16</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>NotRunning</name>
                    <description>LFCLK not running</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Running</name>
                    <description>LFCLK running</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>SRCCOPY</name>
            <description>Copy of LFCLK.SRC register, set when LFCLKSTART task is triggered</description>
            <addressOffset>0x010</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>SRC</name>
                <description>Value of LFCLK.SRC register when LFCLKSTART task was triggered</description>
                <lsb>0</lsb>
                <msb>1</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>LFRC</name>
                    <description>32.768 kHz RC oscillator</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>LFXO</name>
                    <description>32.768 kHz crystal oscillator</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>LFSYNT</name>
                    <description>32.768 kHz synthesized from HFCLK</description>
                    <value>0x2</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
        </cluster>
